In [2]:
import pandas as pd

In [3]:
# Load text file (Feburary medicare certificate)
df=pd.read_fwf('1967feb.txt')
df = df.rename(columns={"This file was downloaded from HathiTrust Digital Library.": "Hospital"})

### Hospital Names

In [4]:
df[df['Hospital'].str.contains(' HOSP$')]

                    Hospital
98             HENRY CO HOSP
99           SHELBY MEM HOSP
100             RUSSELL HOSP
107    SOUTH PICKENS CO HOSP
109           ANOALUSIA HOSP
...                      ...
26346     GOSHEN CO HEM HOSP
26347     PLATTE CO MEM HOSP
26348      WASHAKIE MEM HOSP
26349              LAKE HOSP
26361    AMERICAN SAMOA HOSP

[6411 rows x 1 columns]

In [5]:
data = df[df['Hospital'].str.contains(' HOSP$' or 'HOSP & CLINICS')]

In [6]:
data = data.reset_index()[['Hospital']]

In [7]:
data

                   Hospital
0             HENRY CO HOSP
1           SHELBY MEM HOSP
2              RUSSELL HOSP
3     SOUTH PICKENS CO HOSP
4            ANOALUSIA HOSP
...                     ...
6406     GOSHEN CO HEM HOSP
6407     PLATTE CO MEM HOSP
6408      WASHAKIE MEM HOSP
6409              LAKE HOSP
6410    AMERICAN SAMOA HOSP

[6411 rows x 1 columns]

In [8]:
data.to_excel('Hosp_nm.xls')

### Hospital Address

In [9]:
# A glimspe: Address of Alabama Hospitals
# Need to change the column name later
df[df['Hospital'].str.contains(' ALABAMA \d')]

                         Hospital
104       ABBEVILLF ALABAMA 36310
105       ALABASTER ALABAMA 35007
106  ALEXANOER CITY ALABAMA 35010
108      ALICEVILLE ALABAMA 35442
113       ANOALUSIA ALABAMA 36420
..                            ...
391      MONTGOMERY ALABAMA 36104
392     MONTGiIMFRY ALABAMA 3630B
393      MONTGOMERY ALABAMA 36104
394         MOULTON ALABAMA 35650
395         0NE1NTA ALABAMA 35121

[76 rows x 1 columns]

In [10]:
# Try a few states
state = ['ALABAMA','ALASKA','ARIZONA','ARKANSAS','CALIFORNIA','COLORAOO','CONNECTICUT',
        'OELAWARE','FLORIОA','GEORGIA','HAWAII','IOAHO','ILLINOIS','INOIANA','IOWA',
        'KANSAS','LOUISIANA','MAINE','MARYLANO','MASSACHUSETTS','MICHIGAN','MINNESOTA',
         'MISSISSIPPI','MISSOURI','MONTANA','NEBRASKA','NEW HAMPSHIRE', 'NEW JFRSFY',
        'NEW MEXICO','NEW YORK','NORTH CAROLINA','NORTH OAKOTA','OHIO','OKLAHOMA',
         'OREGON','PENNSYLVANIA','PUERTO RICO','RHOOE ISLANO','SOUTH CAROLINA',
         'SOUTH OAKOTA','TFNNESSEE','TEXAS','UTAH','VERMONT','VIRGINIA','WASHINGTON',
        'WEST VIRGINIA','WISCONSIN','WYOMING']

**Many of the letter 'D' has been decoded into 'O' in the txt file, so we need to be careful here!**
Illinois: ISOINLIL,S1NOInIs,IonIiiI,S1NOInI ,

In [11]:
list = {}
ad = pd.DataFrame()
for s in state:
    rtype = '[a-zA-Z] '+s+' \d'
    list = df[df['Hospital'].str.contains(rtype)]
    list = list.reset_index()[['Hospital']]
    ad = ad.append(list)

In [12]:
ad = ad.rename(columns={'Hospital':'Addess'})

In [13]:
ad.to_excel('Hosp_ad.xls')

In [14]:
ad

                               Addess
0             ABBEVILLF ALABAMA 36310
1             ALABASTER ALABAMA 35007
2        ALEXANOER CITY ALABAMA 35010
3            ALICEVILLE ALABAMA 35442
4             ANOALUSIA ALABAMA 36420
..                                ...
145         WHITEHALL WISCONSIN 54773
146         WILO ROSE WISCONSIN 549B4
147         WINNEBAGO WISCONSIN 549B5
148  WISCONSIN RAPIOS WISCONSIN 54494
149          WOOORUFF WISCONSIN 5456B

[5169 rows x 1 columns]